#include <stdio.h>
#include <string.h>

char room[100][6][50] = {
    {"비전홀", "본관", "", {1}},
    {"보건실", "본관", "", {1}, "안정실"},
    {"도서관", "본관", "", {1}, "디미온", "dimion"},
    {"", "본관", "", {1}},
    {"남학생탈의실", "본관", "급식실 계단 방향", {3}},
    {"교복실", "본관", "급식실 계단 방향", {3}},
    {"문서보관실", "본관", "급식실 계단 방향", {3}},
    {"302호", "본관", "급식실 계단 방향", {3}},
    {"303호", "본관", "급식실 계단 방향", {3}},
    {"304호", "본관", "급식실 계단 방향", {3}},
    {"304호", "본관", "급식실 계단 방향", {3}},
};


int main(int argc, char const *argv[])
{
    
    return 0;
}