    char ROOM[200][4][50] = {
        {"급식실", "본관", "학봉관 방향 계단", {0}},

        {"비전홀", "본관", "중앙계단 앞", {1}}, // 본관 1층
        {"보건실", "본관", "급식실 계단 방향", {1}},
        {"도서관", "본관", "급식실 계단 방향", {1}},
        {"방송실", "본관", "신관 통로 방향", {1}},
        {"비즈쿨실", "본관", "신관 통로 방향", {1}},
        {"과학실", "본관", "신관 통로 방향", {1}},

        {"법인 사무실", "본관", "급식실 계단 방향", {2}}, // 본관 2층
        {"201호", "본관", "급식실 계단 방향", {2}},
        {"202호", "본관", "급식실 계단 방향", {2}},
        {"203호", "본관", "급식실 계단 방향", {2}},
        {"양치하는 공간", "본관", "급식실 계단 방향", {2}},

        {"남학생탈의실", "본관", "급식실 계단 방향", {3}}, // 본관 3층(완)
        {"여학생탈의실", "본관", "비즈쿨실 계단 방향", {3}},
        {"교복실", "본관", "급식실 계단 방향", {3}},
        {"문서보관실", "본관", "급식실 계단 방향", {3}},
        {"미화원 휴게공간", "본관", "급식실 계단 방향", {3}},
        {"본관 3층 화장실", "본관", "중앙계단 옆", {3}},
        {"양치하는 공간", "본관", "비즈쿨실 계단 방향", {3}},
        {"사물함실", "본관", "비즈쿨실 계단 방향", {3}},
        {"제3교무실", "본관", "비즈쿨실 계단 방향", {3}},
        {"상담실", "본관", "비즈쿨실 계단 방향", {3}},
        {"302호", "본관", "급식실 계단 방향", {3}},
        {"303호", "본관", "급식실 계단 방향", {3}},
        {"304호", "본관", "급식실 계단 방향", {3}},
        {"305호", "본관", "급식실 계단 방향", {3}},
        {"306호", "본관", "비즈쿨실 계단 방향", {3}},
        {"307호", "본관", "비즈쿨실 계단 방향", {3}},
        {"1-1반", "본관", "급식실 계단 방향", {3}},
        {"1-2반", "본관", "비즈쿨실 계단 방향", {3}},
        {"1-3반", "본관", "급식실 계단 방향", {3}},
        {"1-4반", "본관", "급식실 계단 방향", {3}},
        {"1-5반", "본관", "비즈쿨실 계단 방향", {3}},
        {"1-6반", "본관", "비즈쿨실 계단 방향", {3}},

        {"시청각실", "신관", "중앙계단 옆 화장실 방향", {1}}, // 신관 1층(완)
        {"IT 프로젝트실", "신관", "시청각실과 화장실 사이", {1}},
        {"화장실", "신관", "중앙계단 옆", {1}},
        {"세미나실", "신관", "중앙계단 옆", {1}},
        {"사물인터넷서비스기획실습실", "신관", "중앙계단 옆", {1}},
        {"엘리베이터", "신관", "중앙계단 앞", {1}},
        {"휴머노이드 연구소", "신관", "3학년부 교무실 앞", {1}},
        {"매점", "신관", "3학년부 교무실 방향", {1}},
        {"매점 테라스", "신관", "매점 앞", {1}},
        {"3학년부 교무실", "신관", "중앙계단 앞 매점 방향", {1}},

        {"멀티미디어실", "신관", "화장실 방향", {2}}, // 신관 2층(완)
        {"신관 2층 화장실", "신관", "엘리베이터 옆", {2}},
        {"IT정보과학영재학급", "신관", "3-6반 앞", {2}},
        {"방송콘텐츠제작실습실", "신관", "멀티미디어실 옆", {2}},
        {"멀티미디어실", "신관", "3-2반 방향", {2}},
        {"연구실", "신관", "중앙 정수기 옆", {2}},
        {"음악실", "신관", "3-1반 방향", {2}},
        {"3-1반", "신관", "음악실 방향", {2}},
        {"3-2반", "신관", "멀티미디어실 방향", {2}},
        {"3-3반", "신관", "음악실 방향", {2}},
        {"3-4반", "신관", "멀티미디어실 방향", {2}},
        {"3-5반", "신관", "음악실 방향", {2}},
        {"3-6반", "신관", "멀티미디어실 방향", {2}},

        {"열람실", "신관", "계단 옆", {3}}, // 신관 3층(완)
        {"엘리베이터", "신관", "계단 앞", {3}},
        {"데이터베이스프로그래밍실습실", "신관", "엘리베이터 앞", {3}},
        {"이사장실", "신관", "계단 앞", {3}},
        {"애니메이션컨텐츠제작실습실", "신관", "이사장실 옆", {3}},
        {"첨단영상제작실", "신관", "이사장실 방향", {3}},
    };