#include <stdio.h>
#include <string.h>
#define INF 1e9

int d[151][151];
int dist[101], k[101], visit[101], path[101], s,e;
char lc_list[151][101] = {"","급식실","문서보관실","도서관","성고충상담실","교장실","보건실","교육행정실","본관1층남자화장실","1층로비","본관중앙입구","본관중앙계단","본관1층여자화장실","휴게실","과학실","제1교무실","비즈쿨실","방송실","대걸레거치대",/*1층,18개*/
        "2-4","201호","2-3","202호","2-1","203호","양치실","본관2층남자화장실","본관2층중앙계단","본관2층여자화장실","서버룸","교구관리실2","2-2","2-5","회계실무실습실","2-6","wee클래스",/*2층,17개,35번*/
        "남학생탈의실","교복실","문서보관실","1-4","302호","1-3","303호","304호","1-1","305호", "미화원휴게공간","본관3층남자화장실","본관3층중앙계단","본관3층여자화장실","양치하는공간","제3교무실","306호","1-5","307호","1-6","1-2","사물함실","여학생탈의실",/*3층,23개, 58번*/
        "체육관","체육관신발장","농구장","스쿼시장","헬스장","탁구장","당구장","거울방",/*체육관,66번*/
        "신관","제2교무실","휴머노이드연구소","매점","세미나실","IT프로젝트실","사물인터넷서비스기획실습실","시청각실","신관1층계단","신관1층화장실"/*신관1층,10개 76번*/,
        "IT정보과학영재학급","3-6","3-4","방송콘텐츠제작실습실","멀티미디어실","신관2층화장실","신관2층계단","연구실","3-1","3-3","3-5","음악실"/*신관 2층 12개,88번*/,
        "열람실","신관3층계단","이사장실","에니메이션컨테츠제작실습실","데이터베이스프로그래밍실습실","첨단영상제작실"/*신관 3층,6개,94번*/,
        "신관4층계단","강당",/*신관4층,2개,96번*/
        "우정학사","잔디밭","축구장","학봉관","스마트팜",/*외부시설,4개,100번*/
        "학봉관1층화장실","3학년독서실","1학년독서실","미술실","학봉관신발장","2학년독서실"};

void input_st()
{
    char st[101], des[101];
    int boool = 0;
    scanf("%s",&st);
    while(getchar()!='\n');
    if(strcmp("return",st)==0)
        return;
    for(int i = 1; i < 106 && boool == 0;i++) {
        if(strcmp(st,lc_list[i])==0){
            boool = 1;
            s = i;
        }
    }
    if(boool == 0)
    {
        char tmp;
        printf("잘못된 입력입니다. 다시 입력하시겠습니까?(y/n) -> ");
        scanf("%c",&tmp);
        if(tmp == 'y'){
            input_st();
            return;
        }
        else
            return;
    }
    printf("%d\n",s);
}

void input_ds() 
{
    int boool = 0;
    char st2[101]="";
    scanf("%s",&st2);
    if(strcmp("return",st2)==0)
        return;
    while(getchar()!='\n');
    for(int i = 1; i < 106 && boool == 0;i++) {
        if(strcmp(st2,lc_list[i])==0){
            boool = 1;
            e = i;
        }
    }
    if(boool == 0)
    {
        char tmp;
        printf("잘못된 입력입니다. 다시 입력하시겠습니까?(y/n) -> ");
        scanf("%c",&tmp);
        if(tmp == 'y'){
            input_ds();
            return;
        }
        else
            return;
    }
    printf("%d\n",e);
    return;
}

void find_path()
{
    int ss, ee;
    int n,boool=0,minnn;
    for(int i = 1; i<=150; i++)
        dist[i] = INF;

    printf("---------------------------------------------------------------------------\n");
    printf("                                  디미고 길안내\n");
    printf("---------------------------------------------------------------------------\n");
    printf("                   찾고 싶은 교실, 교무실 등을 입력하세요.\n");
    printf("                     반 입력시 1-1형식으로 작성해주세요.\n");
    printf("             신발장은 체육관신발장 또는 학봉관신발장 형식으로 작성해주세요.\n");
    printf("                     0을 입력하면 처음으로 돌아갑니다.\n");
    printf("---------------------------------------------------------------------------\n");
    printf("현재 위치를 입력헤주세요.(최소할시 return을 입력해주세요.) -> ");
    
    input_st();
    if(s==0)
        return;
    printf("%d",s);
    printf("목적지를 입력해주세요.(최소할시 return을 입력해주세요.) -> ");
    input_ds();
    if(e==0)
        return;
    dist[s] = 0;
    printf("1.%d %d\n", s,e);
    int v;
    ss=s;
    ee=e;
    for(int i = 1; i <= 150; i++)
	{
		minnn = INF;
		for(int j = 1; j <= 150; j++){
			if(visit[j] == 0 && dist[j] < minnn)
			{
				minnn = dist[j];
				v = j;
			}
		}
		visit[v] = 1;
		for(int j = 1; j <= 150; j++)
		{
			if(dist[j] > dist[v] + d[v][j])
			{
				dist[j] = dist[v] + d[v][j];
				path[j] = v;
			}
		}
	}
    int i = 1,cnt = 0;
	while(ee != 0)
	{
		k[i] = ee;
		ee = path[ee];
		cnt++;
		i++;
	}
	for(int j = cnt; j > 1; j--)
		printf("%s - > ",lc_list[k[j]]);
    printf("%s",lc_list[k[1]]);
}

void create_map()
{
    //본관중앙계단 11번
    //본관1층로비 9번
    //본관2층중앙계단 26번
    //본관3층중앙게단 47번
    for(int i = 1; i <= 150;i++)
        for(int j = 1; j <= 150;j++)
            d[i][j] = INF;
    d[1][11] = 1;
    for(int i = 1; i < 18;i++)
        d[i][i + 1] = d[i + 1][i] = 1;
    for(int i = 19; i <35;i++)
        d[i][i + 1] = d[i + 1][i] = 1;
    for(int i = 36; i < 57; i++)
        d[i][i+1]=d[i+1][i] =1; 
    d[11][27] = d[27][11] = 1;
    d[27][48] = d[48][27] = 1;
    // 여기까지 본관
    //체육관
    d[10][59] = d[59][10] = 1; // 본관 연결
    d[59][67] = d[67][59] = 1; // 신관 연결
    for(int i = 60; i <= 66;i++)
        d[59][i] = d[i][59] = 1;
    d[59][61] = d[61][59] = 1;
    d[60][62] = d[62][60] = 1;
    d[61][63] = d[63][61] = 1;
    d[62][65] = d[65][62] = 1;
    d[62][66] = d[66][62] = 1;
    d[63][65] = d[65][63] = 1;
    d[64][66] = d[66][64] = 1;
    d[63][66] = d[66][63] = 1;
    //신관
    d[10][67] = d[67][10] = 1;
    for(int i = 67; i < 70;i++)
        d[i][i+1] = d[i+1][i] = 1;
    for(int i = 71; i < 76;i++)
        d[i][i+1] = d[i+1][i] = 1;
    d[67][75] = d[75][67] = 1;
    for(int i = 77; i < 88; i++)
        d[i][i+1] = d[i + 1][i] = 1;
    d[83][85] = d[85][83] = 1;
    d[75][83] = d[83][75] = 1;
    for(int i = 89; i < 94; i++)
        d[i][i+1] = d[i + 1][i] = 1;
    d[83][95] = d[95][83] = 1;
    //외부시설(본관)
    d[10][99] = d[99][10] = 1;
    d[10][100] = d[100][10] = 1;
    //외부시설(신관)
    d[67][97] = d[97][67] = 1;
    d[67][99] = d[99][67] = 1;
    d[67][100] = d[100][67] = 1;
    //외부시설(우정학사)
    d[97][101] = d[101][97] = 1;
    d[97][99] = d[99][97] = 1;
    //외부시설(학봉관)
    d[100][67] = d[67][100] = 1;
    d[100][99] = d[99][100] = 1;
    //외부시설(축구장)
    d[99][67] = d[67][99] = 1;
    //학봉관
    d[100][101] = d[101][100] = 1;
    d[101][102] = d[102][101] = 1;
    d[102][103] = d[103][102] = 1;
    d[103][104] = d[104][103] = 1;
    d[100][105] = d[105][100] = 1;
    d[100][106] = d[100][99] = 1;
}

int main()
{
    create_map();
    find_path();
    return 0;
}
