#include <stdio.h>
#include <string.h>
#define INF 1e3

int d[151][151];
int dist[151], k[151], visit[151], path[151], s,e;
char lc_list[151][101] = {"","급식실","문서보관실","도서관","교장실","성고충상담실-여","보건실","교육행정실","본관1층남자화장실","1층로비","본관중앙입구","본관중앙계단","본관1층여자화장실","휴게실","과학실","제1교무실","비즈쿨실","방송실","대걸레거치대",/*1층,18개*/
        "2-4반","201호","2-3반","202호","2-1반","203호","양치실","본관2층남자화장실","본관2층중앙계단","본관2층여자화장실","서버룸","교구관리실2","2-2반","2-5반","회계실무실습실","2-6반","wee클래스",/*2층,17개,35번*/
        "남학생탈의실","교복실","문서보관실","1-4반","302호","1-3반","303호","304호","1-1반","305호", "미화원휴게공간","본관3층남자화장실","본관3층중앙계단","본관3층여자화장실","양치하는공간","제3교무실","306호","1-5반","307호","1-6반","1-2반","사물함실","여학생탈의실",/*3층,23개, 58번*/
        "체육관","체육관신발장","농구장","스쿼시장","헬스장","탁구장","당구장","거울방",/*체육관,66번*/
        "신관","제2교무실","휴머노이드연구소","매점","세미나실","IT프로젝트실","사물인터넷서비스기획실습실","시청각실","신관1층계단","신관1층화장실"/*신관1층,10개 76번*/,
        "IT정보과학영재학급","3-6반","3-4반","방송콘텐츠제작실습실","3-2반","멀티미디어실","신관2층화장실","신관2층계단","연구실","3-1반","3-3반","3-5반","음악실"/*신관 2층 13개,89번*/,
        "열람실","신관3층계단","이사장실","에니메이션컨테츠제작실습실","데이터베이스프로그래밍실습실","첨단영상제작실"/*신관 3층,6개,95번*/,
        "신관4층계단","강당",/*신관4층,2개,97번*/
        "우정학사","잔디밭","축구장","학봉관","스마트팜",/*외부시설,5개,102번*/
        "학봉관1층화장실","3학년독서실","1학년독서실","미술실","학봉관신발장","2학년독서실"};

void input_st()
{
    char st[101]="";
    int boool = 0;
    printf("현재 위치 입력: ");
    fgets(st ,sizeof(st), stdin);
    st[strcspn(st, "\n")] = '\0';

    for(int i = 0 ; i < strlen(st); i++)
        if(st[i] == '\n' || st[i] == ' ')
            st[i] = '\0';
    if(strcmp("0",st)==0)
        return;
    for(int i = 1; i < 108 && boool == 0;i++) {
        if(strcmp(st,lc_list[i])==0){
            boool = 1;
            s = i;
        }
    }
    if(boool == 0)
    {
        char tmp;
        printf("잘못된 입력입니다. 다시 입력하시겠습니까?(y/n): ");
        scanf("%c",&tmp);
        if(tmp == 'y'){
            while(getchar()!='\n');
            input_st();
            return;
        }
        else
            return;
    }
}

void input_ds() 
{
    int boool = 0;
    char st2[101]="";
    printf("목적지 입력: ");
    fgets(st2 ,sizeof(st2), stdin);
    st2[strcspn(st2, "\n")] = '\0';

    if(strcmp("0",st2)==0)
        return;
    for(int i = 0 ; i < strlen(st2); i++)
        if(st2[i] == '\n' || st2[i] == ' ')
            st2[i] = '\0';
    for(int i = 1; i < 108 && boool == 0;i++) {
        if(strcmp(st2,lc_list[i])==0){
            boool = 1;
            e = i;
        }
    }
    if(boool == 0)
    {
        char tmp;
        printf("잘못된 입력입니다. 다시 입력하시겠습니까?(y/n): ");
        scanf("%c",&tmp);
        if(tmp == 'y'){
            while(getchar()!='\n');
            input_ds();
            return;
        }
        else
            return;
    }
    return;
}

int pathfinder()
{
    int ss, ee;
    int boool=0,minnn;
    for(int i = 1; i<=150; i++)
        dist[i] = INF;
    for(int i = 1; i<=150; i++)
        visit[i] = 0;
    for(int i = 1; i<=150; i++)
        path[i] = 0;
    for(int i = 1; i<=150; i++)
        k[i] = 0;
    printf("---------------------------------------------------------------------------\n");
    printf("                               디미고 길안내\n");
    printf("---------------------------------------------------------------------------\n");
    printf("                   찾고 싶은 교실, 교무실 등을 입력하세요.\n");
    printf("                    반 입력시 1-1반형식으로 작성해주세요.\n");
    printf("          본관 1층 교무실은 제1교무실으로 작성해주세요.\n");
    printf("         신발장은 체육관신발장 또는 학봉관신발장 형식으로 작성해주세요.\n");
    printf("                      0을 입력하면 처음으로 돌아갑니다.\n");
    printf("---------------------------------------------------------------------------\n");
    
    input_st();
    if(s==0) return 1;

    input_ds();
    if(e==0) return 1;

    dist[s] = 0;
    int v;
    ss=s;
    ee=e;
    for(int i = 1; i <= 150; i++)
	{
		minnn = INF;
		for(int j = 1; j <= 150; j++){
			if(visit[j] == 0 && dist[j] < minnn)
			{
				minnn = dist[j];
				v = j;
			}
		}
		visit[v] = 1;
		for(int j = 1; j <= 150; j++)
		{
			if(dist[j] > dist[v] + d[v][j])
			{
				dist[j] = dist[v] + d[v][j];
				path[j] = v;
			}
		}
	}
    int i = 1,cnt = 0;
	while(ee != 0)
	{
		k[i] = ee;
		ee = path[ee];
		cnt++;
		i++;
	}
	for(int j = cnt; j > 1; j--)
		printf("%s ->\n",lc_list[k[j]]);
    printf("%s",lc_list[k[1]]);
    printf("\n");

    return 0;
}

void create_map()
{
    //초기화
    for(int i = 1; i <= 150;i++)
        for(int j = 1; j <= 150;j++)
            d[i][j] = INF;
    //본관
    d[1][11] = 7;
    d[9][11] =d[11][9] = 1;
    for(int i = 1; i < 18;i++)
        d[i][i + 1] = d[i + 1][i] = 1;
    for(int i = 19; i <35;i++)
        d[i][i + 1] = d[i + 1][i] = 1;
    for(int i = 36; i < 57; i++)
        d[i][i+1]=d[i+1][i] =1; 
    d[11][27] = d[27][11] = 1;
    d[27][48] = d[48][27] = 1;
    //체육관
    d[10][59] = d[59][10] = 1; // 본관 연결
    d[59][67] = d[67][59] = 1; // 신관 연결
    for(int i = 60; i <= 66;i++)
        d[59][i] = d[i][59] = 1;
    d[59][61] = d[61][59] = 1;
    d[60][62] = d[62][60] = 1;
    d[61][63] = d[63][61] = 1;
    d[62][65] = d[65][62] = 1;
    d[62][66] = d[66][62] = 1;
    d[63][65] = d[65][63] = 1;
    d[64][66] = d[66][64] = 1;
    d[63][66] = d[66][63] = 1;
    //신관
    d[10][67] = d[67][10] = 1;
    for(int i = 67; i < 70;i++)
        d[i][i+1] = d[i+1][i] = 1;
    for(int i = 71; i < 76;i++)
        d[i][i+1] = d[i+1][i] = 1;
    d[67][75] = d[75][67] = 1;
    for(int i = 77; i < 89; i++)
        d[i][i+1] = d[i + 1][i] = 1;
    d[84][86] = d[84][86] = 1;
    d[75][84] = d[84][75] = 1;
    for(int i = 90; i < 95; i++)
        d[i][i+1] = d[i + 1][i] = 1;
    d[84][96] = d[96][84] = 1;
    //외부시설(본관)
    d[10][100] = d[100][10] = 1;
    d[10][101] = d[101][10] = 1;
    //외부시설(신관)
    d[67][98] = d[98][67] = 1;
    d[67][100] = d[100][67] = 1;
    d[67][101] = d[101][67] = 1;
    //외부시설(우정학사)
    d[98][102] = d[102][98] = 1;
    d[98][100] = d[100][98] = 1;
    //외부시설(학봉관)
    d[101][100] = d[100][101] = 1;
    //외부시설(축구장)
    d[99][67] = d[67][99] = 1;
    //학봉관
    d[101][103] = d[103][101] = 1;
    d[103][104] = d[104][103] = 1;
    d[104][105] = d[105][104] = 1;
    d[105][106] = d[106][105] = 1;
    d[102][107] = d[107][102] = 1;
    d[101][108] = d[108][101] = 1;
}
 
int find_path()
{
    create_map();
    return pathfinder();
}
